{
  "backend/main.mo": "Motoko canister implementing user profiles, OTP handling, and registration storage with access control mixins.",
  "feature_evidence.json": "Feature evidence report listing affected frontend files, components, and test IDs for three registration-flow features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of all major frontend files in the registration and admin flows.",
  "frontend/index.css": "Global Tailwind-based styling with OKLCH color tokens, light/dark themes, and base element styling.",
  "frontend/index.html": "Base HTML document loading fonts and mounting the React app root.",
  "frontend/src/App.tsx": "Main React app switching between splash screen, registration flow, and admin panel with flow reset logic.",
  "frontend/src/components/SplashScreen.tsx": "Animated splash screen with reduced-motion support, company branding, skip button, and auto-dismiss timing.",
  "frontend/src/features/admin/AdminPanel.tsx": "Full admin interface handling authentication, role checks, admin claiming, registrations listing, and edit mode UI.",
  "frontend/src/features/admin/components/AdminAccessRecoveryCard.tsx": "UI card for entering and applying an admin setup code, showing loading, success, and error states.",
  "frontend/src/features/admin/components/EditRegistrationDetailsForm.tsx": "Form for editing registration fields with validation, read‑only metadata, and save/cancel handling.",
  "frontend/src/features/admin/hooks/useAdminQueries.ts": "React Query hooks for admin status, roles, registrations, and update operations with cache invalidation.",
  "frontend/src/features/admin/hooks/useAdminSetupCode.ts": "Mutation hook to apply an admin setup code, reinitialize the actor, and refresh admin‑related queries.",
  "frontend/src/features/registration/components/RegistrationStepErrorBoundary.tsx": "Error boundary displaying a recovery UI if a registration step throws an error.",
  "frontend/src/features/registration/hooks/useRegistrationMutations.ts": "Mutation hooks for OTP generation/verification and submitting registration data with file handling.",
  "frontend/src/features/registration/RegistrationFlow.tsx": "Controls multi‑step customer registration flow with validation, navigation, and state for each step.",
  "frontend/src/features/registration/steps/StepCustomerDetails.tsx": "Form step collecting customer personal details with validation and change notifications.",
  "frontend/src/features/registration/steps/StepOTPVerification.tsx": "Handles phone-based OTP generation, verification, and final registration submission.",
  "frontend/src/features/registration/steps/StepTermsAndConditions.tsx": "Displays terms, tracks acceptance, and generates printable proof with timestamp.",
  "frontend/src/features/registration/steps/StepVerificationDocuments.tsx": "Manages Aadhaar, PAN, and optional payment receipt uploads with previews and validation.",
  "frontend/src/features/registration/terms.ts": "Static list of router and service-related terms and conditions.",
  "frontend/src/features/registration/types.ts": "Type definitions for customer details, document data, and step props.",
  "frontend/src/features/registration/validation.ts": "Validation logic for customer details including phone, DOB, email, and address.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor using caching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles, theme variables, dark mode rules, print styles, and splash screen background/animation utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the Internet Identity provider before rendering.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, containers, animations, and registering plugins.",
  "project_state.json": "Stores the project’s current feature set, requirements, known issues, and architectural notes for the build."
}