{
  "backend/main.mo": "Main canister logic handling user profiles, registrations with document blobs, OTP, and admin access control with persistent maps.",
  "backend/migration.mo": "State migration module copying old actor fields to the new structure without transformation.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend admin files and components.",
  "frontend-file-summaries.txt": "Pre-written summaries of all major frontend files used for registration and admin features.",
  "frontend/index.css": "Tailwind base and theme variable definitions with light/dark palettes and global styles.",
  "frontend/index.html": "HTML entry file loading fonts and mounting the React app root.",
  "frontend/src/App.tsx": "Top-level view switcher between splash screen, registration flow, and admin panel with remount logic.",
  "frontend/src/components/SplashScreen.tsx": "Animated splash screen with reduced-motion support and skip option triggering onComplete.",
  "frontend/src/features/admin/AdminPanel.tsx": "Main admin interface handling authentication, admin claiming, registration list/detail display, editing, and deletion workflows.",
  "frontend/src/features/admin/components/AdminAccessRecoveryCard.tsx": "Provides UI for admins to regain access via setup code or username/password login, handling loading, errors, and success states.",
  "frontend/src/features/admin/components/AdminDetailErrorBoundary.tsx": "Error boundary that catches rendering errors in admin detail views and shows a retry option.",
  "frontend/src/features/admin/components/DocumentImagePreview.tsx": "Displays document images with loading, error handling, and retry logic, with a placeholder when no blob is provided.",
  "frontend/src/features/admin/components/EditRegistrationDetailsForm.tsx": "Form allowing admins to edit registration details with change detection, validation, and save/cancel handling.",
  "frontend/src/features/admin/components/RegistrationDetailPanel.tsx": "Shows detailed information for a selected registration with states for empty, loading, error, viewing, and admin actions.",
  "frontend/src/features/admin/hooks/useAdminPasswordLogin.ts": "React Query mutation for admin password login that normalizes backend errors and refreshes admin-related data on success.",
  "frontend/src/features/admin/hooks/useAdminQueries.ts": "Provides React Query hooks for admin actions including role checks, registration fetching, and resilient receipt-aware registration retrieval.",
  "frontend/src/features/admin/hooks/useAdminSetupCode.ts": "Handles applying an admin setup code, updating session state, and invalidating admin-related queries.",
  "frontend/src/features/registration/components/RegistrationStepErrorBoundary.tsx": "Error boundary component that displays a fallback UI and reload option when a registration step fails.",
  "frontend/src/features/registration/hooks/useRegistrationMutations.ts": "Defines mutations for OTP generation, OTP verification, and full registration submission with file-to-blob conversion.",
  "frontend/src/features/registration/RegistrationFlow.tsx": "Implements the multi-step registration UI flow with validation-driven navigation and step components.",
  "frontend/src/features/registration/steps/StepCustomerDetails.tsx": "Customer details form step with validation, error tracking, and controlled state updates.",
  "frontend/src/features/registration/steps/StepOTPVerification.tsx": "Handles OTP generation, verification, and triggers final registration submission with success UI.",
  "frontend/src/features/registration/steps/StepTermsAndConditions.tsx": "Displays terms and conditions with print-friendly proof and tracks user agreement to emit validation with a timestamp.",
  "frontend/src/features/registration/steps/StepVerificationDocuments.tsx": "Handles Aadhaar, PAN, and optional payment receipt uploads with previews and triggers validation updates only when input changes.",
  "frontend/src/features/registration/terms.ts": "Defines structured terms and conditions sections for router and service policies.",
  "frontend/src/features/registration/types.ts": "Declares TypeScript interfaces for customer details, document uploads, and step props.",
  "frontend/src/features/registration/validation.ts": "Validates customer details including required fields, phone format, age check, email, and address length.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and enabling login and logout flows.",
  "frontend/src/index.css": "Tailwind-based global styles including theme variables, dark mode, print styles, and splash screen visuals.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, storing them in sessionStorage, and cleaning parameters from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, fonts, and plugin usage.",
  "project_state.json": "Project metadata describing the app’s registration flow, admin features, issues, and architectural notes."
}