{
  "backend/main.mo": "Motoko canister handling user profiles, registrations, OTP generation/verification, and access control using authorization and blob-storage mixins.",
  "feature_evidence.json": "Feature evidence report listing admin panel bugs, related frontend files, components, and test IDs for build traceability.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files, describing responsibilities for registration flow, admin panel, hooks, styling, and config.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, light/dark OKLCH color variables, and base styling.",
  "frontend/index.html": "Static HTML entry point loading fonts and mounting the React application via main.tsx.",
  "frontend/src/App.tsx": "Root component managing splash screen, view switching between registration and admin panels, and resetting registration flow state.",
  "frontend/src/components/SplashScreen.tsx": "Animated splash screen with reduced-motion support, auto-dismiss timer, and manual skip behavior before loading the app.",
  "frontend/src/features/admin/AdminPanel.tsx": "Admin dashboard handling authentication, role checks, admin claiming, registration selection, detail viewing, and edit mode integration.",
  "frontend/src/features/admin/components/AdminAccessRecoveryCard.tsx": "UI card for entering and applying an admin setup code, showing loading, success, and error states.",
  "frontend/src/features/admin/components/EditRegistrationDetailsForm.tsx": "Form to edit registration fields with validation, save handling, and read-only registration info.",
  "frontend/src/features/admin/components/RegistrationDetailPanel.tsx": "Displays registration details with loading, error, and empty states, plus admin edit and refetch controls.",
  "frontend/src/features/admin/hooks/useAdminQueries.ts": "React Query hooks for admin checks, fetching registrations, fetching single registration with receipt, and updating registrations.",
  "frontend/src/features/admin/hooks/useAdminSetupCode.ts": "Mutation hook to apply an admin setup code, initialize backend access, and refresh related queries.",
  "frontend/src/features/registration/components/RegistrationStepErrorBoundary.tsx": "Error boundary that catches step-level errors and displays a recovery UI with reload option.",
  "frontend/src/features/registration/hooks/useRegistrationMutations.ts": "Provides React Query mutations for OTP generation, OTP verification, and submitting registration with file-to-blob conversions.",
  "frontend/src/features/registration/RegistrationFlow.tsx": "Controls the multi‑step registration process, managing step state, validation, and transitions.",
  "frontend/src/features/registration/steps/StepCustomerDetails.tsx": "Renders and validates a customer details form, updating parent state only when validity or data changes.",
  "frontend/src/features/registration/steps/StepOTPVerification.tsx": "Handles OTP entry, generation, verification, and triggers final registration submission, showing success UI on completion.",
  "frontend/src/features/registration/steps/StepTermsAndConditions.tsx": "Displays terms, manages acceptance state, records acceptance timestamp, and provides a printable proof view.",
  "frontend/src/features/registration/steps/StepVerificationDocuments.tsx": "Manages uploading and previewing Aadhaar, PAN, and optional UPI receipt files while validating document completeness.",
  "frontend/src/features/registration/terms.ts": "Defines the list of terms and conditions sections and items for the registration flow.",
  "frontend/src/features/registration/types.ts": "Declares TypeScript interfaces for customer details, document data, and step props used in registration.",
  "frontend/src/features/registration/validation.ts": "Validates customer details, checking required fields, phone format, age, email, and address completeness.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity, initializing access control and refreshing dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity loading, login, logout, and status state. Includes helper functions to create AuthClient and expose identity via a custom hook.",
  "frontend/src/index.css": "Defines global Tailwind CSS styles, color variables, dark mode settings, print styles, and splash screen background and animations.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentityProvider before rendering App.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and sessionStorage values, including hash-routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration file extending themes, colors, fonts, container settings, and custom keyframes/plugins.",
  "project_state.json": "Tracks project requirements, architecture notes, known issues, and feature metadata for a multi‑step customer registration system."
}