{
  "backend/main.mo": "Main Motoko actor implementing user profiles, registrations, OTP handling, access control, blob storage, and admin credential management with rate-limited login attempts.",
  "backend/migration.mo": "Migration script that resets admin credentials to default values when upgrading, unless they already match the defaults.",
  "feature_evidence.json": "Feature evidence report mapping admin‑panel related features to source files, components, and test IDs with confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files related to registration flow, admin panel, styling, and hooks.",
  "frontend/index.css": "Tailwind base configuration defining OKLCH color variables, dark mode theme values, and global background/foreground styling.",
  "frontend/index.html": "Base HTML entry page setting title, font preloads, and mounting point for the frontend application.",
  "frontend/src/App.tsx": "Root React component handling splash screen timing and switching between the RegistrationFlow and AdminPanel views.",
  "frontend/src/components/SplashScreen.tsx": "Animated splash screen with reduced‑motion support, auto‑dismiss timer, and a manual skip button.",
  "frontend/src/features/admin/AdminPanel.tsx": "Admin dashboard managing Internet Identity login, admin setup, password login, registration list retrieval, and editing/deletion flows.",
  "frontend/src/features/admin/components/AdminAccessRecoveryCard.tsx": "UI card for handling admin access recovery via setup code or password login with identity status display and form interactions.",
  "frontend/src/features/admin/components/AdminDetailErrorBoundary.tsx": "Error boundary that catches rendering failures in admin detail views and provides a retry option.",
  "frontend/src/features/admin/components/DocumentImagePreview.tsx": "Displays document images from blob URLs with loading, error handling, and retry, plus a placeholder when unavailable.",
  "frontend/src/features/admin/components/EditRegistrationDetailsForm.tsx": "Form for editing registration details with controlled fields, validation, and save/cancel handling.",
  "frontend/src/features/admin/components/RegistrationDetailPanel.tsx": "Displays registration details with states for loading, errors, no selection, and supports editing and deletion.",
  "frontend/src/features/admin/hooks/useAdminPasswordLogin.ts": "React Query mutation for admin password login with backend error normalization and query invalidation.",
  "frontend/src/features/admin/hooks/useAdminQueries.ts": "Provides React Query hooks for admin checks, role fetching, claims, and resilient registration retrieval using an actor API.",
  "frontend/src/features/admin/hooks/useAdminSetupCode.ts": "Handles applying an admin setup code, normalizing errors, storing the token, and invalidating related React Query caches.",
  "frontend/src/features/registration/components/RegistrationStepErrorBoundary.tsx": "Error boundary that catches step rendering errors and displays a recovery UI with technical details and a refresh option.",
  "frontend/src/features/registration/hooks/useDoubleInteraction.ts": "Provides a hook to detect double‑click or double‑tap interactions and show a temporary hint on single interactions.",
  "frontend/src/features/registration/hooks/useRegistrationMutations.ts": "Defines mutations for generating OTPs, verifying them, and submitting registrations with document blobs via the actor API.",
  "frontend/src/features/registration/RegistrationFlow.tsx": "Implements the multi‑step registration flow with validation, navigation, and a hidden double‑interaction shortcut to the admin panel.",
  "frontend/src/features/registration/steps/StepCustomerDetails.tsx": "Collects and validates customer details, updating parent validation state only when form validity or data changes.",
  "frontend/src/features/registration/steps/StepOTPVerification.tsx": "Handles phone-based OTP generation, verification, and final registration submission, showing success UI on completion.",
  "frontend/src/features/registration/steps/StepTermsAndConditions.tsx": "Displays T&C, tracks acceptance with timestamp, and supports sanitized printing with customer details and terms.",
  "frontend/src/features/registration/steps/StepVerificationDocuments.tsx": "Manages Aadhaar, PAN, and optional payment receipt uploads with previews and validation callbacks.",
  "frontend/src/features/registration/terms.ts": "Exports structured terms and conditions sections for router and service policies.",
  "frontend/src/features/registration/types.ts": "Defines customer details, document upload data, and shared props interfaces for registration steps.",
  "frontend/src/features/registration/validation.ts": "Validates customer details including phone, age, email, and address, returning field-specific error messages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor bound to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, identity persistence, and status tracking via AuthClient.",
  "frontend/src/index.css": "Defines Tailwind base layers, light/dark theme CSS variables, admin panel dark theme overrides, and splash screen styling and animations.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters using URLSearchParams and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, custom colors tied to CSS variables, fonts, and extended utilities/plugins.",
  "project_state.json": "Tracks project state, requirements, architecture notes, known issues, and existing feature definitions."
}