{
  "backend/main.mo": "Main Motoko actor implementing user registration, OTP verification, admin authentication, and access control with mixins for blob storage and authorization; manages user profiles, registrations, and admin credentials.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files describing the registration flow, admin panel, validation, styling, and component architecture.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color system variables for light and dark themes, including sidebar, chart, and destructive color tokens.",
  "frontend/index.html": "HTML entry point with viewport meta, title \"Star Maharashtra Galaxy Internet\", Orbitron font preload, and root div for React mounting.",
  "frontend/src/App.tsx": "Root React component managing view state between RegistrationFlow and AdminPanel with splash screen gating and registration flow remounting on admin panel exit.",
  "frontend/src/components/SplashScreen.tsx": "Animated splash screen component with galaxy background, company title, tagline, skip button, floating decorative circles, and reduced-motion support.",
  "frontend/src/features/admin/AdminPanel.tsx": "Admin panel component with authentication gating, registration list/detail dual-pane UI, edit mode, delete functionality, admin check, and error boundaries.",
  "frontend/src/features/admin/components/AdminAccessRecoveryCard.tsx": "Card component for admin access recovery offering setup code application and username/password login with diagnostics showing current principal and admin status.",
  "frontend/src/features/admin/components/AdminDetailErrorBoundary.tsx": "React error boundary component that catches and displays errors in the admin detail panel, with retry functionality, error copying to clipboard, and automatic reset when children change.",
  "frontend/src/features/admin/components/AdminPanelErrorBoundary.tsx": "React error boundary component for the entire admin panel that displays error details with copy-to-clipboard functionality and options to retry or refresh the page.",
  "frontend/src/features/admin/components/DocumentImagePreview.tsx": "Component that displays document images from ExternalBlob objects with loading states, error handling, retry functionality, and a placeholder variant for missing documents.",
  "frontend/src/features/admin/components/EditRegistrationDetailsForm.tsx": "Form component for editing registration details (category, payment method, router) with change detection, validation, and mutation handling using React Query.",
  "frontend/src/features/admin/components/RegistrationDetailPanel.tsx": "Main panel component displaying detailed registration information including customer details, documents, and actions like edit, delete, download, and print with various loading and empty states.",
  "frontend/src/features/admin/hooks/useAdminPasswordLogin.ts": "React Query mutation hook for admin password login that normalizes backend errors into user-friendly messages and invalidates relevant queries on successful authentication.",
  "frontend/src/features/admin/hooks/useAdminQueries.ts": "Provides React Query hooks for admin operations: checking admin status, fetching registrations, deleting registrations with optimistic updates, and updating registration details (category, payment method, router).",
  "frontend/src/features/admin/hooks/useAdminSetupCode.ts": "Exports a mutation hook to apply admin setup codes by storing them in sessionStorage and invalidating actor/admin queries to trigger re-authentication with normalized error handling.",
  "frontend/src/features/admin/utils/adminDownloads.ts": "Utility functions to download individual documents from ExternalBlob and batch-download all available documents (Aadhaar, PAN, receipt, photo) for a registration with sanitized filenames.",
  "frontend/src/features/admin/utils/adminPrint.ts": "Generates print-friendly HTML for customer registrations including personal info, service details, terms acceptance, and document checklist with inline CSS for printing.",
  "frontend/src/features/admin/utils/registrationDetails.ts": "Helper functions for registration data: building display names, checking for missing data, formatting timestamps, safely accessing documents, and checking receipt existence.",
  "frontend/src/features/registration/components/RegistrationStepErrorBoundary.tsx": "React error boundary component that catches registration step errors and displays a fallback UI with error details, retry/refresh buttons, and clipboard copy functionality for error reporting.",
  "frontend/src/features/registration/hooks/useDoubleInteraction.ts": "Custom React hook that detects double-click/double-tap interactions and shows a temporary hint after single interactions, with configurable thresholds and durations.",
  "frontend/src/features/registration/hooks/useRegistrationMutations.ts": "Provides React Query mutations for registration flow including OTP generation/verification and registration submission, with automatic user role granting and error normalization.",
  "frontend/src/features/registration/RegistrationFlow.tsx": "Main registration flow component managing four steps (customer details, documents, terms, OTP) with progress tracking, navigation controls, validation state management, and double-interaction admin panel access.",
  "frontend/src/features/registration/steps/StepCustomerDetails.tsx": "Registration form step for collecting customer personal information (name, contact, address, category, payment option, router provision) with validation and error display.",
  "frontend/src/features/registration/steps/StepOTPVerification.tsx": "Registration step that handles Internet Identity authentication, OTP generation/verification via phone number, and final registration submission with success/error states.",
  "frontend/src/features/registration/steps/StepTermsAndConditions.tsx": "Displays terms and conditions with checkbox acceptance, includes print functionality with URL sanitization, and shows acceptance proof with customer details and timestamp.",
  "frontend/src/features/registration/steps/StepVerificationDocuments.tsx": "Registration step for uploading verification documents (Aadhaar, PAN, optional payment receipt and photo) with file preview and validation based on payment method.",
  "frontend/src/features/registration/terms.ts": "Exports static terms and conditions content organized into sections for router terms and service terms.",
  "frontend/src/features/registration/types.ts": "Defines TypeScript interfaces for registration data including CustomerDetailsData (personal info, category, payment), DocumentsData (file uploads), and StepProps for multi-step form validation.",
  "frontend/src/features/registration/utils/normalizeRegistrationError.ts": "Normalizes backend errors (traps, OTP issues, authentication failures) into user-friendly English messages with a [Registration] prefix for consistent error handling.",
  "frontend/src/features/registration/validation.ts": "Validates CustomerDetailsData fields including required fields, phone format (10 digits), age requirement (18+), email format, and minimum address length.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor with authentication, initializes access control with admin token from URL params, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/index.css": "Tailwind CSS configuration with OKLCH color system for light/dark themes, admin panel dark mode styling, and splash screen galaxy background with animations.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence and secure parameter clearing from URLs.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom OKLCH color variables, Inter/Orbitron fonts, container settings, extended theme colors for UI components, and animation keyframes.",
  "project_state.json": "Project state tracking admin authentication issues where a user lost their Internet Identity anchor and needs their new principal ID 'p-3sib2-hfxnj-zit4w-kqyca-3r66g' added to the backend admin whitelist. Two pending action requests: update admin whitelist and redeploy the application."
}