{
  "backend/main.mo": "Motoko canister implementing access control, user profiles, customer registration, OTP generation and verification, and admin‑only registration retrieval.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to affected frontend admin files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend registration and admin‑panel files for reference.",
  "frontend/index.css": "Tailwind base/theme definitions using OKLCH color tokens with light and dark mode variables.",
  "frontend/index.html": "Root HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level component toggling between RegistrationFlow and AdminPanel views.",
  "frontend/src/features/admin/AdminPanel.tsx": "Full admin panel UI handling authentication, admin status checks, setup code application, registration browsing, and recovery flows.",
  "frontend/src/features/admin/components/AdminAccessRecoveryCard.tsx": "Card UI for denied‑access state providing admin setup code entry, apply flow, and troubleshooting guidance.",
  "frontend/src/features/admin/hooks/useAdminQueries.ts": "Provides React Query hooks for admin checks, role retrieval, claiming admin access, and fetching registrations or a single registration.",
  "frontend/src/features/admin/hooks/useAdminSetupCode.ts": "Handles applying an admin setup code, storing it, initializing admin access, and refreshing related queries.",
  "frontend/src/features/registration/hooks/useRegistrationMutations.ts": "Defines mutations for generating OTPs, verifying OTPs, and submitting a full registration including document uploads.",
  "frontend/src/features/registration/RegistrationFlow.tsx": "Implements the multi-step customer registration UI flow with navigation, state management, and progress handling.",
  "frontend/src/features/registration/steps/StepCustomerDetails.tsx": "Renders the customer details form, validates inputs, and reports validity and data upstream.",
  "frontend/src/features/registration/steps/StepOTPVerification.tsx": "Manages OTP generation, verification, and final registration submission, showing success when complete.",
  "frontend/src/features/registration/steps/StepTermsAndConditions.tsx": "Displays terms and conditions and notifies when the user accepts them with a timestamp.",
  "frontend/src/features/registration/steps/StepVerificationDocuments.tsx": "React component handling Aadhaar and PAN file uploads, validation, and UI display for the registration flow.",
  "frontend/src/features/registration/terms.ts": "Exports structured terms and conditions for router usage and service rules.",
  "frontend/src/features/registration/types.ts": "Defines TypeScript interfaces for customer details, document data, and step props in the registration process.",
  "frontend/src/features/registration/validation.ts": "Provides validation logic for customer details including required fields, phone, age, email, and address checks.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on Internet Identity authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements authentication context and provider for managing Internet Identity login, logout, and identity state.",
  "frontend/src/index.css": "Tailwind CSS setup defining global styles, theme variables, and dark mode color tokens.",
  "frontend/src/main.tsx": "Application entry point initializing React, QueryClient, and InternetIdentityProvider before rendering App.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash-based routes.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, containers, animations, and enabling plugins.",
  "project_state.json": "Stores the project's versioned state, goals, architectural notes, issues, and implemented registration-flow features. Highlights a 4‑step registration system, an admin panel requirement, and known admin access bugs."
}