{
  "backend/main.mo": "Main backend canister handling user profiles, registrations, OTP generation/verification, admin login credentials, and access control via mixins and maps.",
  "feature_evidence.json": "Feature evidence report describing a splash screen branding update and listing affected files, components, and metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of multiple frontend source files for reference.",
  "frontend/index.css": "Global Tailwind CSS variables and themes including light/dark palettes, borders, and base styling.",
  "frontend/index.html": "HTML entry point setting up the root app container, title, and font imports.",
  "frontend/src/App.tsx": "Top-level React component handling splash screen, view switching between registration and admin, and registration flow resets.",
  "frontend/src/components/SplashScreen.tsx": "Animated splash screen component showing company name with reduced‑motion support and skip behavior.",
  "frontend/src/features/admin/AdminPanel.tsx": "Admin panel with authentication, registration list/detail views, edit/delete flows, and admin claim/recovery logic.",
  "frontend/src/features/admin/components/AdminAccessRecoveryCard.tsx": "UI card enabling admin access recovery via setup code or username/password login with error handling and loading states.",
  "frontend/src/features/admin/components/AdminDetailErrorBoundary.tsx": "Error boundary that catches render failures in admin detail views and provides a retry option.",
  "frontend/src/features/admin/components/DocumentImagePreview.tsx": "Component that loads and displays document images with placeholders, error handling, and retry support.",
  "frontend/src/features/admin/components/EditRegistrationDetailsForm.tsx": "Form for editing registration fields with change detection, validation, and save/cancel handling.",
  "frontend/src/features/admin/components/RegistrationDetailPanel.tsx": "Panel showing registration details with loading, error, empty, and delete states plus admin actions.",
  "frontend/src/features/admin/hooks/useAdminPasswordLogin.ts": "React Query mutation for admin password login that normalizes errors and refreshes admin-related queries on success.",
  "frontend/src/features/admin/hooks/useAdminQueries.ts": "Provides admin-related queries and mutations, including admin checks, role fetch, registrations, and resilient registration-with-receipt lookup.",
  "frontend/src/features/admin/hooks/useAdminSetupCode.ts": "Applies an admin setup code, stores it in session, and forces reinitialization and refetching of admin-related queries.",
  "frontend/src/features/registration/components/RegistrationStepErrorBoundary.tsx": "Error boundary that catches step-level errors and shows a refresh prompt with technical details.",
  "frontend/src/features/registration/hooks/useRegistrationMutations.ts": "Defines mutations for OTP generation, OTP verification, and final registration submission with file-to-blob conversions.",
  "frontend/src/features/registration/RegistrationFlow.tsx": "Manages the multi‑step registration workflow, handling step transitions, validation, and data collection for customer details, documents, terms, and OTP.",
  "frontend/src/features/registration/steps/StepCustomerDetails.tsx": "Renders and validates the customer details form, reporting validity and data changes upward.",
  "frontend/src/features/registration/steps/StepOTPVerification.tsx": "Handles OTP generation, verification, and triggers final registration submission, showing success upon completion.",
  "frontend/src/features/registration/steps/StepTermsAndConditions.tsx": "Displays terms and conditions with print-proof layout and tracks acceptance to report validation with a timestamp.",
  "frontend/src/features/registration/steps/StepVerificationDocuments.tsx": "Handles Aadhaar, PAN, and optional payment receipt uploads with previews and reports validation only when inputs change.",
  "frontend/src/features/registration/terms.ts": "Defines structured router and service terms used in the registration flow.",
  "frontend/src/features/registration/types.ts": "Provides TypeScript types for customer details, documents, and step props in the registration process.",
  "frontend/src/features/registration/validation.ts": "Validates customer details fields including required fields, phone, age, email, and address rules.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, logout, identity loading, and status tracking.",
  "frontend/src/index.css": "Tailwind-based theme definitions, dark mode, admin theme, splash animations, and print styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and clean them from the hash for routing flows.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, fonts, and plugins for styling the frontend.",
  "project_state.json": "Tracks project state, requirements, features, architecture notes, and known issues for the customer registration app."
}