{
  "backend/main.mo": "Motoko canister handling user profiles, registrations, OTP generation/verification, and admin authentication with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping two print‑sanitization features to their related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend registration and admin components, validation logic, styles, and print‑safety behavior.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables for light/dark themes, with global border and body background/foreground setup.",
  "frontend/index.html": "Base HTML document loading Orbitron font and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Root app component managing splash screen, switching between registration flow and admin panel, and resetting registration state when returning from admin.",
  "frontend/src/components/SplashScreen.tsx": "Animated splash screen with reduced‑motion support, auto‑dismiss logic, and optional skip button.",
  "frontend/src/features/admin/AdminPanel.tsx": "Admin panel handling identity login, admin role checks, registration fetching/editing/deleting, and admin setup code or password login flows.",
  "frontend/src/features/admin/components/AdminAccessRecoveryCard.tsx": "Provides a UI for admins to regain access using either a setup code or username/password, handling form state, validation, and visual feedback.",
  "frontend/src/features/admin/components/AdminDetailErrorBoundary.tsx": "Error boundary component that catches rendering failures in admin detail views and offers a retry mechanism.",
  "frontend/src/features/admin/components/DocumentImagePreview.tsx": "Displays document previews with loading, error handling, and retry logic, falling back to a placeholder when a blob is missing or invalid.",
  "frontend/src/features/admin/components/EditRegistrationDetailsForm.tsx": "Form for editing registration details with change detection, controlled inputs, and save/cancel handling.",
  "frontend/src/features/admin/components/RegistrationDetailPanel.tsx": "Shows detailed registration data with loading, error, empty, and selection states, plus actions like edit, refetch, and delete.",
  "frontend/src/features/admin/hooks/useAdminPasswordLogin.ts": "React Query mutation hook for admin password login that normalizes backend errors and refreshes admin-related queries on success.",
  "frontend/src/features/admin/hooks/useAdminQueries.ts": "Provides admin-related React Query hooks for checking admin status, fetching roles and registrations, and resiliently fetching registration details.",
  "frontend/src/features/admin/hooks/useAdminSetupCode.ts": "Stores an admin setup code, reinitializes the actor, and aggressively refreshes admin-related queries.",
  "frontend/src/features/registration/components/RegistrationStepErrorBoundary.tsx": "Error boundary that catches step failures and shows a recovery UI with technical details and refresh option.",
  "frontend/src/features/registration/hooks/useDoubleInteraction.ts": "Implements a double‑click/tap detection hook that shows hints and triggers a callback on successful double interaction.",
  "frontend/src/features/registration/hooks/useRegistrationMutations.ts": "Defines mutations for OTP generation/verification and submits registration data with file-to-blob conversion.",
  "frontend/src/features/registration/RegistrationFlow.tsx": "Manages the multi‑step customer registration flow, validation state, and hidden double‑interaction navigation to the admin panel.",
  "frontend/src/features/registration/steps/StepCustomerDetails.tsx": "Customer details form with validation, error display, and controlled state updates passed back via onValidationChange.",
  "frontend/src/features/registration/steps/StepOTPVerification.tsx": "Handles phone-based OTP generation, verification, and final registration submission with UI states.",
  "frontend/src/features/registration/steps/StepTermsAndConditions.tsx": "Displays terms, tracks acceptance with timestamp, and provides a sanitized print-friendly proof document.",
  "frontend/src/features/registration/steps/StepVerificationDocuments.tsx": "Manages Aadhaar, PAN, and optional receipt uploads with previews and validation change updates.",
  "frontend/src/features/registration/terms.ts": "Exports structured router and service terms for display in the registration flow.",
  "frontend/src/features/registration/types.ts": "Defines customer details, document data, and step prop types used in registration steps.",
  "frontend/src/features/registration/validation.ts": "Validates customer detail fields including name, phone, DOB, email, and address, returning error messages.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login handling, stored identity loading, and status tracking.",
  "frontend/src/index.css": "Defines Tailwind layers, light/dark theme color variables, global styles, admin panel forced-dark theme, and splash screen galaxy background/animations.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers and loading global CSS.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, persisting, and clearing URL parameters and session-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, container settings, custom keyframes, and plugin integrations.",
  "project_state.json": "Tracks project state, requirements, architectural notes, known issues, and feature versions for the customer registration app."
}