{
  "backend/main.mo": "Motoko canister handling user profiles, OTPs, registrations, and admin auth with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries for all key frontend files including registration flow, admin panel, hooks, and styling.",
  "frontend/index.css": "Tailwind base styles and OKLCH color tokens with light/dark theme variables and global UI resets.",
  "frontend/index.html": "Basic HTML entry point loading fonts and mounting the React app.",
  "frontend/src/App.tsx": "Root component switching between splash screen, registration flow, and admin panel with remounting logic.",
  "frontend/src/components/SplashScreen.tsx": "Animated splash screen with reduced-motion support, skip button, and timed auto-dismiss.",
  "frontend/src/features/admin/AdminPanel.tsx": "Full admin interface with authentication, registration list/detail views, editing, deletion, and access recovery logic.",
  "frontend/src/features/admin/components/AdminAccessRecoveryCard.tsx": "UI card for recovering admin access via code or username/password with form handling states and errors.",
  "frontend/src/features/admin/components/AdminDetailErrorBoundary.tsx": "Error boundary that catches rendering errors in admin detail views and shows a retry UI.",
  "frontend/src/features/admin/components/DocumentImagePreview.tsx": "Displays a document image with loading and error states, plus a placeholder variant for missing images.",
  "frontend/src/features/admin/components/EditRegistrationDetailsForm.tsx": "Form for editing registration details with change detection, validation, and save/cancel handling.",
  "frontend/src/features/admin/components/RegistrationDetailPanel.tsx": "Panel displaying registration details with loading, error, empty states, image previews, and admin actions.",
  "frontend/src/features/admin/hooks/useAdminPasswordLogin.ts": "React Query mutation for admin password login with backend error normalization and post‑login cache updates.",
  "frontend/src/features/admin/hooks/useAdminQueries.ts": "Provides admin-related queries and mutations for roles, registrations, and resilient registration fetching.",
  "frontend/src/features/admin/hooks/useAdminSetupCode.ts": "Defines a hook that stores an admin setup code, reinitializes the backend actor, and invalidates related admin queries.",
  "frontend/src/features/registration/components/RegistrationStepErrorBoundary.tsx": "Provides an error boundary for registration steps, showing an error card with technical details and a refresh option.",
  "frontend/src/features/registration/hooks/useRegistrationMutations.ts": "Defines OTP generation, OTP verification, and registration submission mutations, converting uploaded files to blobs before sending.",
  "frontend/src/features/registration/RegistrationFlow.tsx": "Implements a multi-step registration flow managing step state, validation, and navigation between customer details, documents, terms, and OTP verification.",
  "frontend/src/features/registration/steps/StepCustomerDetails.tsx": "Renders the customer details form, performs validation, and reports validity and data changes upstream.",
  "frontend/src/features/registration/steps/StepOTPVerification.tsx": "Handles OTP generation, OTP verification, and triggers final registration submission, showing success UI when completed.",
  "frontend/src/features/registration/steps/StepTermsAndConditions.tsx": "Displays terms and conditions, tracks acceptance with a timestamp, and provides a printable acceptance-proof document.",
  "frontend/src/features/registration/steps/StepVerificationDocuments.tsx": "React step component that handles Aadhaar, PAN, and optional payment receipt uploads with previews and validation callbacks.",
  "frontend/src/features/registration/terms.ts": "Exports static registration terms covering router and service policies.",
  "frontend/src/features/registration/types.ts": "Defines TypeScript interfaces for customer details, document data, and step props used in registration.",
  "frontend/src/features/registration/validation.ts": "Validates customer details fields including phone, DOB, email, and address, returning error messages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider to manage login, stored identity, and authentication state.",
  "frontend/src/index.css": "Tailwind CSS setup with theme variables, dark mode, print styles, and splash screen visuals.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity Provider before rendering the app.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom fonts, OKLCH color variables, extended theming, and animation keyframes.",
  "project_state.json": "Project state file describing the app’s registration workflow, planned features, known issues, and architectural notes for ongoing development."
}