{
  "backend/main.mo": "Motoko canister handling user profiles, customer registrations, OTP generation/verification, and admin‑restricted registration queries with access control mixins.",
  "feature_evidence.json": "Feature evidence listing frontend files, components, and test IDs for admin panel and admin query integration features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file involved in registration and admin flows.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color tokens, light/dark variables, and global background/foreground styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level React component switching between registration flow and admin panel views.",
  "frontend/src/features/admin/AdminPanel.tsx": "Admin UI handling authentication, admin-claim flow, registration list, and detailed registration view.",
  "frontend/src/features/admin/hooks/useAdminQueries.ts": "React Query hooks for admin role checks, admin claiming, and fetching registrations or single registration entries.",
  "frontend/src/features/registration/hooks/useRegistrationMutations.ts": "Defines React Query mutations for generating and verifying OTPs and submitting registration data, including converting uploaded files to blobs.",
  "frontend/src/features/registration/RegistrationFlow.tsx": "Multi-step customer registration UI coordinating form steps, navigation, and admin panel link.",
  "frontend/src/features/registration/steps/StepCustomerDetails.tsx": "Presents a form for entering customer details, validates inputs, and reports validity and data upward.",
  "frontend/src/features/registration/steps/StepOTPVerification.tsx": "Handles OTP generation, verification, and triggers registration submission, showing success UI upon completion.",
  "frontend/src/features/registration/steps/StepTermsAndConditions.tsx": "Displays terms and conditions and reports acceptance with a timestamp when the user agrees.",
  "frontend/src/features/registration/steps/StepVerificationDocuments.tsx": "Manages file uploads for Aadhaar and PAN documents and reports validity and selected files upward.",
  "frontend/src/features/registration/terms.ts": "Exports structured text sections for router and service-related terms and conditions.",
  "frontend/src/features/registration/types.ts": "Defines TypeScript interfaces for registration steps including customer details, documents, and step props.",
  "frontend/src/features/registration/validation.ts": "Validates customer detail fields such as name, phone, DOB, email, and address, returning error messages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to user identity, handling authentication and access control initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status tracking. Wraps AuthClient creation with configurable options and exposes identity state via a custom hook.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables for light and dark mode, applying them globally to the app. Sets up color tokens, border behavior, and default body styling.",
  "frontend/src/main.tsx": "Bootstraps the React application, wrapping the root component with React Query and Internet Identity providers. Imports global styles and renders the App component.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL hash. Supports both standard and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom colors, fonts, radii, animations, and plugin integration. Maps CSS variables to theme colors and extends layout and animation utilities.",
  "project_state.json": "Stores project metadata, versioning, and feature requirements for a multi‑step customer registration app and admin panel. Documents existing features and architectural notes."
}