{
  "backend/main.mo": "Motoko canister providing access‑controlled user profiles, public customer registration with document blobs, and OTP generation/verification plus admin‑only registration queries.",
  "feature_evidence.json": "Feature evidence listing two splash‑screen styling changes with their affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to short functional summaries for build/reference use.",
  "frontend/index.css": "Global Tailwind and OKLCH theme variables plus base styles for light/dark modes.",
  "frontend/index.html": "HTML entry point loading Orbitron font and mounting the frontend app.",
  "frontend/src/App.tsx": "App root managing splash‑screen gating and switching between registration and admin views.",
  "frontend/src/components/SplashScreen.tsx": "Animated splash screen showing stylized multicolor company name with auto‑dismiss and skip options.",
  "frontend/src/features/admin/AdminPanel.tsx": "Full admin panel handling authentication, admin role checks, setup‑code flow, and viewing registrations.",
  "frontend/src/features/admin/components/AdminAccessRecoveryCard.tsx": "UI card allowing users to enter an admin setup code with states for applying, success, and error handling.",
  "frontend/src/features/admin/hooks/useAdminQueries.ts": "Provides React Query hooks to check admin status, fetch roles, claim admin access, and retrieve registrations.",
  "frontend/src/features/admin/hooks/useAdminSetupCode.ts": "Mutation hook to apply an admin setup code, initialize admin access, and refresh admin-related queries.",
  "frontend/src/features/registration/hooks/useRegistrationMutations.ts": "Defines mutations to generate and verify OTP and submit registration data including document uploads.",
  "frontend/src/features/registration/RegistrationFlow.tsx": "Manages multi-step customer registration flow with navigation, progress, and step validation.",
  "frontend/src/features/registration/steps/StepCustomerDetails.tsx": "Form step for collecting customer details with validation and change tracking.",
  "frontend/src/features/registration/steps/StepOTPVerification.tsx": "Handles OTP generation, verification, and triggers final registration submission with success state.",
  "frontend/src/features/registration/steps/StepTermsAndConditions.tsx": "Renders the terms and conditions scroll area with an agreement checkbox and reports acceptance with a timestamp.",
  "frontend/src/features/registration/steps/StepVerificationDocuments.tsx": "Handles Aadhaar and PAN file uploads with validation, previews, and change/remove actions, reporting validity to the parent step.",
  "frontend/src/features/registration/terms.ts": "Exports structured terms and conditions sections for router and service policies.",
  "frontend/src/features/registration/types.ts": "Defines TypeScript interfaces for customer details, document data, and step props used in the registration flow.",
  "frontend/src/features/registration/validation.ts": "Validates customer details fields including required values, phone format, age, email, and address length.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity authentication, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, loading, login, logout, and identity persistence.",
  "frontend/src/index.css": "Defines global Tailwind layers, color variables, dark theme values, and splash screen animations.",
  "frontend/src/main.tsx": "Bootstraps the app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, retrieve, and clear URL and sessionStorage parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, containers, animations, and plugin integrations.",
  "project_state.json": "Defines the project’s current state, requirements, features, and architectural notes for the registration app."
}