{
  "backend/main.mo": "Motoko canister handling user profiles, registrations, OTP generation/verification, and admin auth with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report listing splash screen text update, galaxy background addition, and related styling updates with associated files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files for registration, admin features, styling, hooks, and configuration.",
  "frontend/index.css": "Global Tailwind/OKLCH theme variables and base styles including dark mode and layout-level CSS rules.",
  "frontend/index.html": "HTML entry page defining metadata, Orbitron font, and root mount point for the frontend app.",
  "frontend/src/App.tsx": "Top-level React app handling splash screen flow and switching between registration flow and admin panel.",
  "frontend/src/components/SplashScreen.tsx": "Animated splash screen with galaxy background, company title, reduced-motion support, auto-dismiss timer, and skip button.",
  "frontend/src/features/admin/AdminPanel.tsx": "Admin panel component managing authentication, admin setup, registration viewing/editing, and role-based behavior.",
  "frontend/src/features/admin/components/AdminAccessRecoveryCard.tsx": "UI card enabling admin access recovery through code application or username/password login with state handling for errors and loading.",
  "frontend/src/features/admin/components/AdminDetailErrorBoundary.tsx": "React error boundary that catches rendering errors in admin detail panels and shows a retryable error UI.",
  "frontend/src/features/admin/components/DocumentImagePreview.tsx": "Component that loads and displays document images with loading, error handling, retries, and a placeholder when missing.",
  "frontend/src/features/admin/components/EditRegistrationDetailsForm.tsx": "Form for editing registration details with controlled state, validation, and save/cancel handling.",
  "frontend/src/features/admin/components/RegistrationDetailPanel.tsx": "Panel displaying registration details with multiple UI states including empty, loading, error, view, and edit modes plus delete support.",
  "frontend/src/features/admin/hooks/useAdminPasswordLogin.ts": "React Query mutation hook for admin password login with backend error normalization and post-login query invalidation.",
  "frontend/src/features/admin/hooks/useAdminQueries.ts": "Provides React Query hooks for admin checks, user role, registrations, and resilient registration-with-receipt fetching.",
  "frontend/src/features/admin/hooks/useAdminSetupCode.ts": "Applies an admin setup code, stores it in session, and invalidates/refetches admin-related queries.",
  "frontend/src/features/registration/components/RegistrationStepErrorBoundary.tsx": "Error boundary that displays a fallback UI and refresh option when a registration step fails.",
  "frontend/src/features/registration/hooks/useRegistrationMutations.ts": "Defines mutations for OTP generation, OTP verification, and submitting registration data with file uploads.",
  "frontend/src/features/registration/RegistrationFlow.tsx": "Controls the multi-step registration flow, managing step state, validation, and transitions.",
  "frontend/src/features/registration/steps/StepCustomerDetails.tsx": "Renders and validates customer details form fields, reporting validity changes upward.",
  "frontend/src/features/registration/steps/StepOTPVerification.tsx": "Handles OTP generation, verification, and final registration submission with success feedback.",
  "frontend/src/features/registration/steps/StepTermsAndConditions.tsx": "Displays terms acceptance UI, tracks agreement state, and generates printable proof with customer info and timestamp.",
  "frontend/src/features/registration/steps/StepVerificationDocuments.tsx": "Handles Aadhaar, PAN, and optional payment receipt uploads with previews and validation triggering.",
  "frontend/src/features/registration/terms.ts": "Provides static terms and conditions sections with router and service policies.",
  "frontend/src/features/registration/types.ts": "Defines TypeScript interfaces for customer details, document data, and step props.",
  "frontend/src/features/registration/validation.ts": "Validates customer details fields including required text, phone, age, email, and address rules.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating related queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/index.css": "Defines Tailwind base styles, light/dark themes, admin panel theme, and splash screen animations.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), store them in sessionStorage, retrieve persisted values, and clear them from storage or the URL hash.",
  "frontend/tailwind.config.js": "Defines Tailwind CSS setup with dark mode, content paths, typography and animation plugins, and an extended theme including fonts, colors, radii, shadows, and keyframes.",
  "project_state.json": "Contains the project’s current build state, requirements, architectural notes, known issues, and feature metadata for the customer registration app."
}