{
  "backend/main.mo": "Motoko canister implementing access control, user profiles, registrations, OTP handling, and blob-based document storage.",
  "feature_evidence.json": "Feature evidence report mapping fixes and enhancements to specific frontend files and components with linked test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files, their responsibilities, and recent functional updates.",
  "frontend/index.css": "Global Tailwind-based styles defining OKLCH theme variables, dark mode tokens, and base element styling.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Root component handling splash screen, view switching between registration and admin, and remounting registration flow.",
  "frontend/src/components/SplashScreen.tsx": "Animated splash screen with reduced-motion support, auto-dismiss timing, and a skip button.",
  "frontend/src/features/admin/AdminPanel.tsx": "Admin panel handling authentication, registration list management, selection, editing, deletion, and detail viewing.",
  "frontend/src/features/admin/components/AdminAccessRecoveryCard.tsx": "A UI card offering admin access recovery via setup code or username/password, showing identity diagnostics and handling form submissions with loading and error states.",
  "frontend/src/features/admin/components/AdminDetailErrorBoundary.tsx": "An error boundary that catches rendering errors in registration detail views and displays a recovery panel with troubleshooting steps and a retry option.",
  "frontend/src/features/admin/components/AdminPanelErrorBoundary.tsx": "An error boundary for the entire admin panel that shows a full‑screen error card with retry and page refresh options.",
  "frontend/src/features/admin/components/DocumentImagePreview.tsx": "Component that loads and displays a document image via direct URL with loading, error handling, and retry support, plus a placeholder variant.",
  "frontend/src/features/admin/components/EditRegistrationDetailsForm.tsx": "A form for editing registration fields such as category, payment method, and router, supporting change detection and update mutation feedback.",
  "frontend/src/features/admin/components/RegistrationDetailPanel.tsx": "Displays detailed customer registration info with loading, error, empty, and selection states, along with document previews, edit actions, and deletion flow.",
  "frontend/src/features/admin/hooks/useAdminPasswordLogin.ts": "Provides a React Query mutation for admin password login with backend error normalization and admin-related cache invalidation.",
  "frontend/src/features/admin/hooks/useAdminQueries.ts": "Defines queries and mutations for checking admin status, managing registrations, and performing optimistic updates via the backend actor.",
  "frontend/src/features/admin/hooks/useAdminSetupCode.ts": "Implements a mutation to apply an admin setup code, storing it, reinitializing the actor, and refreshing admin-related queries with error normalization.",
  "frontend/src/features/admin/utils/registrationDetails.ts": "Utility functions for formatting registration data, validating missing fields, accessing documents, and generating display names.",
  "frontend/src/features/registration/components/RegistrationStepErrorBoundary.tsx": "Error boundary component that catches step errors and displays a recovery UI with technical details and a refresh option.",
  "frontend/src/features/registration/hooks/useDoubleInteraction.ts": "Custom hook detecting double‑click/tap interactions and showing a hint before triggering a callback.",
  "frontend/src/features/registration/hooks/useRegistrationMutations.ts": "Defines React Query mutations for generating and verifying OTPs and submitting registration data, including converting uploaded files into ExternalBlob objects.",
  "frontend/src/features/registration/RegistrationFlow.tsx": "Manages the multi‑step customer registration workflow, including step navigation, validation, and hidden double‑interaction admin access.",
  "frontend/src/features/registration/steps/StepCustomerDetails.tsx": "Renders the customer details form and reports validation state upward while tracking field changes and validation differences.",
  "frontend/src/features/registration/steps/StepOTPVerification.tsx": "Handles OTP generation, verification, and triggers registration submission once OTP is validated.",
  "frontend/src/features/registration/steps/StepTermsAndConditions.tsx": "Displays terms, manages acceptance state, timestamps acceptance, and provides a sanitized print flow for proof of acceptance.",
  "frontend/src/features/registration/steps/StepVerificationDocuments.tsx": "Allows users to upload Aadhaar, PAN, and optional payment receipt files, producing previews and validating required documents.",
  "frontend/src/features/registration/terms.ts": "Exports static terms and conditions grouped into router and service sections.",
  "frontend/src/features/registration/types.ts": "Defines TypeScript interfaces for customer details, document uploads, and step props used throughout the registration flow.",
  "frontend/src/features/registration/validation.ts": "Validates customer details fields including phone, DOB, email, and address, returning error messages per field.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches a backend actor based on identity, handling anonymous mode, access control initialization, and dependent query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, including login, logout, and status states.",
  "frontend/src/index.css": "Defines Tailwind base layers, color variables, dark mode themes, and custom styles for splash screen and admin panel UI.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the InternetIdentityProvider before rendering App.",
  "frontend/src/utils/urlParams.ts": "Utility functions for parsing URL parameters, storing sensitive params in sessionStorage, sanitizing URLs, and restoring them.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and container settings with custom design tokens.",
  "project_state.json": "Stores project metadata including requirements, architectural notes, existing features, and known issues for the app."
}