{
  "kind": "build_request",
  "title": "Fix Admin Panel registration detail opening and missing Edit option",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-55",
      "text": "Fix the Admin Panel so selecting a customer registration (\"customer id\") reliably opens the registration detail view on the right side, instead of failing to open or appearing blank.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "are wo customer id open nhi ho rahi hai aur edit ka option bhi nhi aa raha hai check ke"
        ]
      },
      "acceptanceCriteria": [
        "When the admin clicks any item in the \"Customer Registrations\" list, the right panel shows the selected registration’s details.",
        "The UI must not appear blank; it must render an explicit loading state while the registration detail query is in-flight.",
        "If the registration detail fetch fails (e.g., canister error, not found, unauthorized), show a clear English error message in the right panel with a retry action.",
        "If no registration is selected yet, show a clear English placeholder message instructing the admin to select a registration from the list."
      ]
    },
    {
      "id": "REQ-56",
      "text": "Fix the Admin Panel so an \"Edit Details\" option is shown whenever a registration is selected and the user is authorized as admin, and ensure entering edit mode reliably renders the existing edit form.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "are wo customer id open nhi ho rahi hai aur edit ka option bhi nhi aa raha hai check ke"
        ]
      },
      "acceptanceCriteria": [
        "When a registration is selected and the admin is not currently editing, an \"Edit Details\" button is visible in the registration detail view.",
        "Clicking \"Edit Details\" always opens the edit form (using the existing EditRegistrationDetailsForm) populated with the selected registration’s current values.",
        "If the selected registration detail is still loading, the \"Edit Details\" button is hidden or disabled (no broken/empty edit screen).",
        "All user-facing text introduced/changed for this fix is in English."
      ]
    },
    {
      "id": "REQ-57",
      "text": "Ensure Admin Panel edit-save flow remains stable after fixing the detail view, including clear save-loading/error feedback and returning to the updated detail view after a successful save.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ]
      },
      "acceptanceCriteria": [
        "Saving changes shows a clear in-progress state (no double submissions).",
        "After a successful save, the detail view reflects the updated data (list and detail are refreshed via React Query invalidation).",
        "If save fails, an English error message is shown and the admin remains in edit mode so they can retry or cancel."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/immutablePaths (e.g., frontend/src/hooks/useActor.ts, frontend/src/hooks/useInternetIdentity.ts, frontend/src/main.tsx, frontend/src/components/ui/*).",
    "Keep all user-facing UI text in English."
  ],
  "nonGoals": [
    "Do not add new authentication providers or third-party integrations.",
    "Do not change the backend registration schema or admin authorization model unless it is strictly required to fix the Admin Panel detail/edit rendering issue."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}