{
  "kind": "build_request",
  "title": "Fix Registration Flow: Customer Details page sometimes fails to open",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-52",
      "text": "Fix the bug that prevents the Step 1 \"Customer Details\" page from opening/rendering reliably in the registration flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "FIRSE OPRN NHI HO RAHA HAI CUSTOMER DETILS PAGE"
        ]
      },
      "acceptanceCriteria": [
        "Launching the app always renders the registration view with Step 1 (Customer Details) visible after the splash completes.",
        "Switching between Admin Panel and Registration always returns the user to a working registration view where Step 1 can be opened and used.",
        "No infinite render loops or UI freezes occur when StepCustomerDetails calls onValidationChange as the user types."
      ]
    },
    {
      "id": "REQ-53",
      "text": "Stabilize Step validation callbacks in the registration flow so step components do not re-run validation effects due to changing function identities on every parent render.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "FIRSE OPRN NHI HO RAHA HAI CUSTOMER DETILS PAGE"
        ]
      },
      "acceptanceCriteria": [
        "The callback passed as onValidationChange to step components is referentially stable across renders (or each step safely avoids depending on a changing callback reference).",
        "Step 1 validation state updates do not trigger repeated unnecessary effects when formData is unchanged.",
        "The Step 1 page remains responsive while typing in any field (no input lag/freezing)."
      ]
    },
    {
      "id": "REQ-54",
      "text": "Add a user-visible fallback UI for unexpected registration-step rendering errors so the app does not appear blank when Step 1 fails; all user-facing text must be in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "FIRSE OPRN NHI HO RAHA HAI CUSTOMER DETILS PAGE"
        ]
      },
      "acceptanceCriteria": [
        "If an unexpected error occurs while rendering the registration flow/Step 1, the UI shows an English error message (e.g., \"Customer Details page failed to load. Please refresh the page.\") instead of a blank screen.",
        "The fallback UI provides a clear recovery action (at minimum: a Refresh button that reloads the page).",
        "Normal behavior is unchanged when no error occurs."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or any files under frontend/src/components/ui (immutable paths).",
    "Use English for any new user-facing UI text."
  ],
  "nonGoals": [
    "Do not change the registration form fields/requirements or add new registration steps.",
    "Do not introduce any new backend APIs or modify backend state for this fix unless proven necessary to resolve the Step 1 opening issue."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}