{
  "kind": "build_request",
  "title": "Fix Admin Setup Code reset flow so admin recovery works",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-20",
      "text": "Fix the backend `resetAdminSetupCode()` behavior so the Admin Setup Code reset flow can succeed for the legitimate admin user even when they are currently not recognized as admin by permission checks (i.e., they cannot access admin-only APIs because the setup code is missing/invalid). The backend must still prevent unauthorized users from resetting the admin setup code.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "they not work reset admin password"
        ]
      },
      "acceptanceCriteria": [
        "When a user is signed in with the correct Internet Identity for the configured admin, calling `resetAdminSetupCode()` returns a newly generated setup code instead of trapping with \"Unauthorized: Only admins can reset the setup code\".",
        "When a user is signed in with an Internet Identity that is not the configured admin, calling `resetAdminSetupCode()` fails with a clear English error message and does not rotate the code.",
        "Resetting the admin setup code rotates the code to a new value (not a constant like \"new-setup-code\")."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Update the Admin Panel recovery UI to show clear, actionable error messaging when Admin Setup Code reset fails (for example, due to being signed in with the wrong Internet Identity), including instructions in English to sign out and sign back in with the correct admin Internet Identity and then retry.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "they not work reset admin password"
        ]
      },
      "acceptanceCriteria": [
        "If the reset call traps/throws, the Access Denied recovery card shows an English error message that includes the reason returned from the canister when available.",
        "The UI text refers to \"Admin Setup Code\" (not \"password\") while still addressing the user’s intent (resetting admin access)."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Ensure the reset success path reliably re-initializes admin access after the new Admin Setup Code is generated by: (1) storing it under `sessionStorage` key `caffeineAdminToken`, (2) re-initializing access control, and (3) refreshing admin-related React Query state so the Admin Panel unlocks without a manual page refresh.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "they not work reset admin password"
        ]
      },
      "acceptanceCriteria": [
        "After a successful reset, the app automatically applies the new code and the Admin Panel transitions from the Access Denied recovery UI to the authorized admin view without requiring a manual browser refresh.",
        "After reset+auto-apply, `isAdmin` becomes true and registrations queries can load (subject to having data)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in `backend/main.mo`).",
    "Do not attempt any external SMS, email, or third-party integrations.",
    "Do not edit files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or any `frontend/src/components/ui` sources (compose instead).",
    "Use English for all user-facing UI text."
  ],
  "nonGoals": [
    "Implementing third-party authentication beyond Internet Identity.",
    "Adding any out-of-band admin recovery infrastructure (email/SMS support, external databases, or human verification).",
    "Changing the customer registration flow behavior unrelated to admin access recovery."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}