{
  "kind": "build_request",
  "title": "Update splash screen company name font and add color styling",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-41",
      "text": "Update the splash screen company name styling in `frontend/src/components/SplashScreen.tsx` to use a different, more stylized display font (different from the default sans) for the text \"STAR MAHARASHTRA GALAXY INTERNET\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-3"
        ],
        "quotes": [
          "font change kar aur colour add kar name mai"
        ]
      },
      "acceptanceCriteria": [
        "On the splash screen, the company name text renders with a clearly different font style than the current default (e.g., a display/branding font feel).",
        "The company name text remains exactly: \"STAR MAHARASHTRA GALAXY INTERNET\" (spelling/case/wording unchanged).",
        "The splash screen continues to auto-transition, fade out, and allow skipping as before."
      ]
    },
    {
      "id": "REQ-42",
      "text": "Add color styling to the splash screen company name text so it is no longer a single flat color (e.g., multi-color per word or a gradient effect), while keeping the tagline text unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-3"
        ],
        "quotes": [
          "font change kar aur colour add kar name mai"
        ]
      },
      "acceptanceCriteria": [
        "The company name text displays visible color styling (multi-color or gradient) across the words, and the result is clearly noticeable.",
        "The tagline remains exactly: \"Connect to the Future with Internet at Light Speed.\" and remains readable against the background.",
        "In reduced-motion mode (`prefers-reduced-motion: reduce`), the new font and color styling still apply, and animations remain disabled as currently implemented."
      ]
    }
  ],
  "constraints": [
    "Do not make any backend changes for this request.",
    "Do not edit files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or anything under `frontend/src/components/ui`.",
    "Keep all user-facing text in English (no new non-English UI copy)."
  ],
  "nonGoals": [
    "Changing the splash screen timing/transition behavior beyond preserving existing behavior.",
    "Changing the tagline text or overall app theme outside the splash company name styling.",
    "Adding or reintroducing a logo image on the splash screen."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}