{
  "kind": "build_request",
  "title": "Update splash screen animation to show company name “Star Maharashtra Galaxy Internet”",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-96",
      "text": "Update the app start splash/intro animation screen to display the company name text exactly as: \"Star Maharashtra Galaxy Internet\" (replace the current \"SMGI\" / \"Network Solutions\" branding text). Preserve existing splash behavior: auto-transition timing, fade-out, click/tap-to-skip, and reduced-motion support.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "app start karne par animation me muze mere company ne ka naam de  Star Maharashtra Galaxy Internet"
        ]
      },
      "acceptanceCriteria": [
        "On app load, the Splash Screen shows the text exactly \"Star Maharashtra Galaxy Internet\" (matching spelling and capitalization), and it is visible as the primary branding text.",
        "The texts \"SMGI\" and \"Network Solutions\" are not displayed anywhere on the splash screen.",
        "Clicking/tapping anywhere on the splash screen still skips it and transitions to the main app UI.",
        "The splash screen still auto-transitions after the existing timeout and fades out before entering the main UI.",
        "When the user has prefers-reduced-motion enabled, the splash screen uses the reduced-motion behavior and still transitions quickly (no blocking animation).",
        "No backend changes are required or introduced for this update."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/hooks/useInternetIdentity.ts(x) or frontend/src/hooks/useActor.ts (immutable paths).",
    "Keep all user-facing UI text in English.",
    "Do not add any backend changes for the splash screen update."
  ],
  "nonGoals": [
    "Changing the registration flow or admin panel behavior.",
    "Adding or changing logos, images, or other splash assets.",
    "Changing the splash screen background theme, animations, or timing beyond what is required to update the displayed company name text."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}