{
  "kind": "build_request",
  "title": "Fix Admin Panel: customer details, documents, and Terms & Conditions not showing in Registration Details",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-140",
      "text": "Fix the Admin Panel Registration Details view so it reliably displays the submitted customer details (First Name, Middle Name, Surname, Date of Birth, Email ID, Address, Phone) for every registration where those fields exist in stored data, instead of showing only “N/A” or appearing missing.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "In my admin panel, customer details, documents, and Terms & Conditions form submissions are not showing. Please check and resolve the issue."
        ]
      },
      "acceptanceCriteria": [
        "When an admin selects a registration in the Admin Panel, the Registration Details view shows the actual stored values for the customer’s personal details when present in the canister record.",
        "If a registration is in a legacy/older format where some fields were not collected/stored, the UI still renders the section and shows a clear English fallback value (e.g., “Not provided”) rather than appearing blank or broken.",
        "No runtime errors or blank panels occur when opening Registration Details for any registration in the list."
      ]
    },
    {
      "id": "REQ-141",
      "text": "Fix the Admin Panel Registration Details view so it reliably displays the Terms & Conditions information for the selected registration, including (a) the stored terms acceptance timestamp and (b) the same Terms & Conditions text that customers see during registration.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "In my admin panel, customer details, documents, and Terms & Conditions form submissions are not showing. Please check and resolve the issue."
        ]
      },
      "acceptanceCriteria": [
        "The Registration Details view contains a clearly labeled “Terms and Conditions” section.",
        "The section displays the stored `termsAcceptedAt` timestamp for the selected registration in a readable format.",
        "The section displays the Terms & Conditions content from `frontend/src/features/registration/terms.ts` (same wording/sections as customer flow)."
      ]
    },
    {
      "id": "REQ-142",
      "text": "Fix Admin Panel document visibility so uploaded verification documents (Aadhaar Card, PAN Card) and the optional payment receipt image (when present) reliably render as image previews in the Registration Details view for authorized admins.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "In my admin panel, customer details, documents, and Terms & Conditions form submissions are not showing. Please check and resolve the issue."
        ]
      },
      "acceptanceCriteria": [
        "For a registration that has Aadhaar and PAN blobs stored, the Admin Panel shows both document previews under a clearly labeled “Verification Documents” section.",
        "If a registration includes an optional receipt blob, the receipt preview is shown; if it does not, the UI shows an English placeholder (e.g., “Receipt not provided”) without errors.",
        "If a document preview cannot be loaded, the UI shows a clear English error state and a Retry action (no silent failures, no blank area).",
        "Blob/document access works for authorized admins (i.e., admin can fetch/render the same stored blobs that were uploaded during registration)."
      ]
    },
    {
      "id": "REQ-143",
      "text": "Add an Admin Panel diagnostics-friendly, user-visible non-sensitive warning when the selected registration data is incomplete or in an unexpected/legacy shape, without exposing document contents or secrets.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "In my admin panel, customer details, documents, and Terms & Conditions form submissions are not showing. Please check and resolve the issue."
        ]
      },
      "acceptanceCriteria": [
        "If the selected registration is missing expected fields (e.g., missing `personalInfo` or missing `documents` entries), the detail panel shows a concise English warning (e.g., “This submission was created with an older version and may not include all fields.”).",
        "The warning does not include sensitive data (no tokens, no raw blob IDs/URLs if they are sensitive, no stack traces in normal mode)."
      ]
    }
  ],
  "constraints": [
    "Use English for all user-facing UI text.",
    "Do not edit files under `frontend/src/components/ui` (compose them only).",
    "Do not edit immutable hook files listed in SYSTEM_CONTEXT (e.g., `frontend/src/hooks/useActor.ts`, `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/main.tsx`).",
    "Backend must remain a single Motoko actor in `backend/main.mo`; only add/adjust `backend/migration.mo` if a state upgrade is required to fix legacy records."
  ],
  "nonGoals": [
    "Adding new registration steps or changing the customer registration UX beyond what is necessary to fix Admin Panel visibility issues.",
    "Integrating external SMS, email, or any third-party storage/CDN for documents.",
    "Introducing new backend services, databases, or non-Motoko backends."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}