{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin Panel recovery UX + reliable Admin Setup Code reset/apply unlock",
  "requirements": [
    {
      "id": "REQ-21",
      "summary": "Improve Admin Panel recovery UI with clear, actionable English error messaging for failed Admin Setup Code resets (including sign-out/sign-in guidance).",
      "acceptanceCriteria": [
        "If the reset call traps/throws, the Access Denied recovery card shows an English error message that includes the reason returned from the canister when available.",
        "The UI text refers to \"Admin Setup Code\" (not \"password\") while still addressing the user’s intent (resetting admin access)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/admin/AdminPanel.tsx",
          "operation": "modify",
          "description": "Adjust how reset/apply errors are surfaced to the Access Denied recovery UI so the message reliably includes the underlying thrown/trapped reason when available (preserve the raw message and avoid replacing it with generic text). Ensure user-facing wording consistently says \"Admin Setup Code\". Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/admin/components/AdminAccessRecoveryCard.tsx",
          "operation": "modify",
          "description": "Enhance the reset-failure UI: when reset fails, show clear English guidance explaining likely cause (signed in with the wrong Internet Identity), and provide actionable steps: sign out, sign back in with the correct admin Internet Identity, then retry resetting the Admin Setup Code. Keep terminology as \"Admin Setup Code\" throughout. Use existing shadcn-ui composed components (Alert/Card/Button/Input) for messaging layout. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Make the reset success path automatically apply the new Admin Setup Code and refresh admin access/React Query state so the Admin Panel unlocks without manual refresh.",
      "acceptanceCriteria": [
        "After a successful reset, the app automatically applies the new code and the Admin Panel transitions from the Access Denied recovery UI to the authorized admin view without requiring a manual browser refresh.",
        "After reset+auto-apply, `isAdmin` becomes true and registrations queries can load (subject to having data)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/admin/hooks/useAdminSetupCode.ts",
          "operation": "modify",
          "description": "Ensure the reset success flow is fully sequenced and reliable: (1) store the generated code under sessionStorage key `caffeineAdminToken` (via existing session helper), (2) re-initialize access control by calling the actor’s secret initialization function, and only then (3) refresh admin-related React Query state by invalidating and explicitly refetching `isAdmin`, `userRole`, and `registrations` so the UI unlocks immediately. Also ensure the manual apply path follows the same pattern (store -> initialize -> refresh). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/admin/AdminPanel.tsx",
          "operation": "modify",
          "description": "Update post-reset/post-apply handling to rely on the hook’s immediate query refresh rather than time-based delays where possible, so the Admin Panel transitions from Access Denied to the authorized view promptly after success. Ensure any remaining success UI state is cleared only after queries have refreshed. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}