{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin Panel Registration Details: fix missing personal info, documents, and Terms visibility",
  "requirements": [
    {
      "id": "REQ-140",
      "summary": "Ensure Admin Panel Registration Details reliably renders stored customer personal details with clear English fallbacks for legacy/incomplete records.",
      "acceptanceCriteria": [
        "When an admin selects a registration in the Admin Panel, the Registration Details view shows the actual stored values for the customer’s personal details when present in the canister record.",
        "If a registration is in a legacy/older format where some fields were not collected/stored, the UI still renders the section and shows a clear English fallback value (e.g., “Not provided”) rather than appearing blank or broken.",
        "No runtime errors or blank panels occur when opening Registration Details for any registration in the list."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/admin/components/RegistrationDetailPanel.tsx",
          "operation": "modify",
          "description": "Harden Personal Information rendering to use safe accessors (no assumptions about presence of personalInfo) and replace “N/A”/hidden rows with consistent English fallbacks like “Not provided”; ensure phone/address/email/DOB/name fields render reliably even for legacy/incomplete shapes. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/admin/utils/registrationDetails.ts",
          "operation": "create",
          "description": "Add small helpers to normalize/format registration fields for display (e.g., value-or-fallback, display-name builder, and safe reads) to keep RegistrationDetailPanel resilient to missing/legacy shapes. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-141",
      "summary": "Show a clearly labeled Terms and Conditions section with stored acceptance timestamp and the same terms text used in the customer registration flow.",
      "acceptanceCriteria": [
        "The Registration Details view contains a clearly labeled “Terms and Conditions” section.",
        "The section displays the stored `termsAcceptedAt` timestamp for the selected registration in a readable format.",
        "The section displays the Terms & Conditions content from `frontend/src/features/registration/terms.ts` (same wording/sections as customer flow)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/admin/components/RegistrationDetailPanel.tsx",
          "operation": "modify",
          "description": "Render a dedicated “Terms and Conditions” section within Registration Details that (1) shows `termsAcceptedAt` using the provided formatter and (2) renders the TERMS_AND_CONDITIONS content from the shared registration module (same text as customer flow). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-142",
      "summary": "Reliably render Aadhaar, PAN, and optional receipt as image previews in Registration Details with clear placeholders and retryable error states.",
      "acceptanceCriteria": [
        "For a registration that has Aadhaar and PAN blobs stored, the Admin Panel shows both document previews under a clearly labeled “Verification Documents” section.",
        "If a registration includes an optional receipt blob, the receipt preview is shown; if it does not, the UI shows an English placeholder (e.g., “Receipt not provided”) without errors.",
        "If a document preview cannot be loaded, the UI shows a clear English error state and a Retry action (no silent failures, no blank area).",
        "Blob/document access works for authorized admins (i.e., admin can fetch/render the same stored blobs that were uploaded during registration)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/admin/components/RegistrationDetailPanel.tsx",
          "operation": "modify",
          "description": "Make document mapping resilient and explicit: always show a “Verification Documents” section with Aadhaar + PAN slots (using fallbacks when missing) and an optional Receipt slot using receipt presence; avoid brittle assumptions that cause blank areas. Continue composing the existing DocumentImagePreview component for previews. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/admin/components/DocumentImagePreview.tsx",
          "operation": "modify",
          "description": "Improve placeholders and error copy to match requirements (e.g., “Receipt not provided” when receipt is absent) while continuing to use blob-storage ExternalBlob direct URL rendering via `getDirectURL()` for cached/streamed previews; keep the retry flow and ensure failures never render blank. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/admin/utils/registrationDetails.ts",
          "operation": "modify",
          "description": "Add helpers for picking Aadhaar/PAN blobs from `registration.documents` defensively (e.g., safe indexing and clear missing-doc messages) and for deciding which placeholders to show without throwing. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-143",
      "summary": "Show a non-sensitive, user-visible warning when selected registration data is incomplete or in an unexpected/legacy shape.",
      "acceptanceCriteria": [
        "If the selected registration is missing expected fields (e.g., missing `personalInfo` or missing `documents` entries), the detail panel shows a concise English warning (e.g., “This submission was created with an older version and may not include all fields.”).",
        "The warning does not include sensitive data (no tokens, no raw blob IDs/URLs if they are sensitive, no stack traces in normal mode)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/admin/AdminPanel.tsx",
          "operation": "modify",
          "description": "Compute a diagnostics-friendly warning string for the selected registration when required sections/fields are missing (legacy/incomplete shape) and pass it to RegistrationDetailPanel via the existing `dataWarning` prop without including sensitive details. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/admin/utils/registrationDetails.ts",
          "operation": "modify",
          "description": "Add a pure helper that inspects a Registration object and returns a concise, non-sensitive warning message when expected fields are missing (e.g., missing personalInfo, insufficient documents, missing receipt when expected), suitable for display in the admin UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/admin/components/RegistrationDetailPanel.tsx",
          "operation": "modify",
          "description": "Ensure the warning UI renders consistently and safely (already uses an Alert), and confirm it is shown for missing/legacy shapes (not only for query errors) with English-only text and no sensitive content. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}