{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stabilize registration Step 1 rendering and validation callbacks",
  "requirements": [
    {
      "id": "REQ-52",
      "summary": "Fix unreliable rendering/opening of Step 1 (Customer Details) in the registration flow, including when returning from the Admin Panel.",
      "acceptanceCriteria": [
        "Launching the app always renders the registration view with Step 1 (Customer Details) visible after the splash completes.",
        "Switching between Admin Panel and Registration always returns the user to a working registration view where Step 1 can be opened and used.",
        "No infinite render loops or UI freezes occur when StepCustomerDetails calls onValidationChange as the user types."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure returning from the Admin Panel reliably remounts the registration flow (e.g., via a key/reset signal) so Step 1 always initializes and renders after the splash completes."
        },
        {
          "path": "frontend/src/features/registration/RegistrationFlow.tsx",
          "operation": "modify",
          "description": "Add defensive guards for step selection (avoid out-of-range step indices) and ensure the flow initializes to Step 1 on mount/reset; also prepare wiring for stable validation callback handling and error fallback wrapper (see REQ-53/REQ-54)."
        },
        {
          "path": "frontend/src/features/registration/steps/StepCustomerDetails.tsx",
          "operation": "modify",
          "description": "Prevent Step 1 from triggering parent state churn during typing by reducing redundant validation updates and avoiding effect re-triggers tied to changing callback identities."
        }
      ]
    },
    {
      "id": "REQ-53",
      "summary": "Make registration step validation callbacks referentially stable (or make step effects resilient) to prevent repeated validation effects and input lag/freezing.",
      "acceptanceCriteria": [
        "The callback passed as onValidationChange to step components is referentially stable across renders (or each step safely avoids depending on a changing callback reference).",
        "Step 1 validation state updates do not trigger repeated unnecessary effects when formData is unchanged.",
        "The Step 1 page remains responsive while typing in any field (no input lag/freezing)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/registration/RegistrationFlow.tsx",
          "operation": "modify",
          "description": "Replace the inline onValidationChange handler with memoized, step-aware callbacks (e.g., useCallback) so the function identity is stable across renders and does not retrigger child validation effects unnecessarily."
        },
        {
          "path": "frontend/src/features/registration/steps/StepCustomerDetails.tsx",
          "operation": "modify",
          "description": "Stabilize validation side-effects by (a) not depending on a changing onValidationChange reference (e.g., store latest callback in a ref), and (b) only calling onValidationChange when computed validity/data meaningfully changes to avoid repeated effects when formData is unchanged."
        },
        {
          "path": "frontend/src/features/registration/steps/StepVerificationDocuments.tsx",
          "operation": "modify",
          "description": "Apply the same callback-stability pattern used in Step 1 (avoid effect dependency on changing callbacks and avoid redundant onValidationChange calls) to prevent similar render/validation churn in later steps."
        }
      ]
    },
    {
      "id": "REQ-54",
      "summary": "Add an English fallback UI for unexpected registration step rendering errors with a clear recovery action (Refresh).",
      "acceptanceCriteria": [
        "If an unexpected error occurs while rendering the registration flow/Step 1, the UI shows an English error message (e.g., \"Customer Details page failed to load. Please refresh the page.\") instead of a blank screen.",
        "The fallback UI provides a clear recovery action (at minimum: a Refresh button that reloads the page).",
        "Normal behavior is unchanged when no error occurs."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/registration/components/RegistrationStepErrorBoundary.tsx",
          "operation": "create",
          "description": "Create a registration-scoped React Error Boundary that renders an English error message and a Refresh button (reloads the page) when a step throws during render."
        },
        {
          "path": "frontend/src/features/registration/RegistrationFlow.tsx",
          "operation": "modify",
          "description": "Wrap the step renderer (including Step 1) with the new RegistrationStepErrorBoundary so unexpected step rendering errors show the English fallback UI instead of a blank screen."
        }
      ]
    }
  ]
}