{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update splash screen company name font and add color styling",
  "requirements": [
    {
      "id": "REQ-41",
      "summary": "Apply a stylized display font to the splash screen company name text without changing copy or behavior.",
      "acceptanceCriteria": [
        "On the splash screen, the company name text renders with a clearly different font style than the current default (e.g., a display/branding font feel).",
        "The company name text remains exactly: \"STAR MAHARASHTRA GALAXY INTERNET\" (spelling/case/wording unchanged).",
        "The splash screen continues to auto-transition, fade out, and allow skipping as before."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Load a chosen display/branding webfont (e.g., via hosted font stylesheet links in <head>) so the splash company name can reliably render in a non-default stylized font while keeping all text English-only and preserving existing splash behavior."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Extend Tailwind fontFamily with a dedicated display font stack (e.g., fontFamily.display) that uses the newly loaded webfont with sensible fallbacks, enabling consistent styling for the splash company name."
        },
        {
          "path": "frontend/src/components/SplashScreen.tsx",
          "operation": "modify",
          "description": "Update the company name <h1> styling to use the new Tailwind display font class (keeping the rendered text exactly \"STAR MAHARASHTRA GALAXY INTERNET\") and ensure no changes to the existing auto-transition, fade-out, or skip interactions."
        }
      ]
    },
    {
      "id": "REQ-42",
      "summary": "Add clearly noticeable multi-color/gradient styling to the splash screen company name while leaving the tagline unchanged and honoring reduced-motion behavior.",
      "acceptanceCriteria": [
        "The company name text displays visible color styling (multi-color or gradient) across the words, and the result is clearly noticeable.",
        "The tagline remains exactly: \"Connect to the Future with Internet at Light Speed.\" and remains readable against the background.",
        "In reduced-motion mode (`prefers-reduced-motion: reduce`), the new font and color styling still apply, and animations remain disabled as currently implemented."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add CSS rules for the existing splash word span classes (e.g., .splash-word-star/.splash-word-maharashtra/.splash-word-galaxy/.splash-word-internet) to apply multi-color styling (per-word colors or a text gradient effect) that remains readable on the splash background; ensure reduced-motion media query continues to disable animations while still applying the new font/color styling."
        },
        {
          "path": "frontend/src/components/SplashScreen.tsx",
          "operation": "modify",
          "description": "Adjust company-name markup/classes only as needed to support the new multi-color/gradient styling (e.g., ensure span classes are retained/used and do not affect the tagline); keep existing reduced-motion logic and the splash timing/transition/skip behavior unchanged."
        }
      ]
    }
  ]
}